Revit 2027 API
ElementTransformUtils.CanMirrorElements Method
 Determines whether elements can be mirrored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanMirrorElements(
	Document ADoc,
	ICollection<ElementId> elemIds
)
Public Shared Function CanMirrorElements (
	ADoc As Document,
	elemIds As ICollection(Of ElementId)
) As Boolean
public:
static bool CanMirrorElements(
	Document^ ADoc,
	ICollection<ElementId^>^ elemIds
)
static member CanMirrorElements :
        ADoc : Document *
        elemIds : ICollection<ElementId> -> bool
Parameters
ADoc Document
 The document where the elements reside.
elemIds ICollection<ElementId>
 The elements identified by id.
Return Value
Boolean
 True if the elements can be mirrored.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementTransformUtils Class
Autodesk.Revit.DB Namespace